[
  {
    "id": "1",
    "title": "Booki - Page d'accueil d'une agence de voyage",
    "cover": "/img/booki.png",
    "description": [
      "Intégration responsive de la page d'accueil d'une agence de voyage (mobile, tablette, desktop).",
      "Développement manuel en HTML et CSS à partir de maquettes Figma.",
      "Respect des spécifications techniques et des contraintes design fournies.",
      "Collaboration avec la CTO et le designer UI pour garantir une expérience utilisateur optimale.",
      "Versionnement du projet sur GitHub avec suivi rigoureux des modifications."
    ],
    "langage": "CSS",
    "competences": [
      "Intégrer du contenu conformément à une maquette avec HTML et CSS",
      "Implémenter une interface responsive avec HTML et CSS"
    ],
    "pictures": ["./img/booki-1.png", "./img/booki-2.png", "./img/booki-3.png"],
    "repo": "https://github.com/hp590490/projet1-Booki"
  },
  {
    "id": "2",
    "title": "Gaming Campus - Page d'accueil d'une école gaming",
    "cover": "/img/campus.png",
    "description": [
      "Reproduction fidèle du design final, sans maquettes interactives type Figma. Démonstration d'autonomie et de résolution de problèmes en travaillant sans outils interactifs ",
      "Développement manuel en HTML/CSS, avec une attention particulière aux détails et à la conformité au design fourni.",
      "Mise en œuvre d'une interface responsive, optimisée pour les mobiles et compatible avec différentes tailles d'écran."
    ],
    "langage": "CSS",
    "competences": [
      "Intégrer du contenu conformément à une maquette avec HTML et CSS",
      "Implémenter une interface responsive avec HTML et CSS"
    ],
    "pictures": [
      "./img/gaming-1.png",
      "./img/gaming-2.png",
      "./img/gaming-3.png"
    ],
    "repo": "https://github.com/hp590490/gamingcampus"
  },
  {
    "id": "3",
    "title": "The Resto - Page d'accueil d'un restaurant gastronomique",
    "cover": "/img/resto.png",
    "description": [
      "Création d'une page d'accueil pour un restaurant gastronomique, avec un design classe et épuré.",
      "Utilisation de SASS pour une organisation optimisée et modulaire du code CSS.",
      "Implémentation d'un design responsive, garantissant une expérience utilisateur fluide sur mobile, tablette et desktop.",
      "Respect des principes de design minimaliste pour refléter l'image haut de gamme du restaurant.",
      "Structuration du code sémantique et utilisation de pratiques modernes pour maximiser la lisibilité et la maintenance."
    ],
    "langage": "SASS",
    "competences": [
      "Intégrer du contenu conformément à une maquette avec HTML et CSS",
      "Implémenter une interface responsive avec HTML et CSS"
    ],
    "pictures": [
      "./img/resto-1.png",
      "./img/resto-2.png",
      "./img/resto-3.png",
      "./img/resto-4.png",
      "./img/resto-5.png"
    ]
  },
  {
    "id": "4",
    "title": "Sophie Bluel - Architecte d'intérieur",
    "cover": "/img/sophie.png",
    "description": [
      "Développement d'une page de présentation dynamique des travaux d'une architecte d'intérieur en manipulant le DOM avec JavaScript.",
      "Création from scratch d'une page de connexion sécurisée pour l'administrateur du site.",
      "Implémentation d'une modale interactive pour l'upload de nouveaux médias.",
      "Communication avec une API pour tester et faire persister les données sur le site.",
      "Collaboration avec des outils professionnels : maquettes Figma, gestion de tâches via Kanban, et versionnement avec GitHub."
    ],
    "langage": "JavaScript",
    "competences": [
      "Intégrer du contenu conformément à une maquette avec HTML et CSS",
      "Implémenter une interface responsive avec HTML et CSS"
    ],
    "pictures": [
      "./img/sophie-1.png",
      "./img/sophie-2.png",
      "./img/sophie-3.png",
      "./img/sophie-4.png",
      "./img/sophie-5.png"
    ],
    "repo": "https://github.com/hp590490/ProjetJS_SophieBruel"
  },
  {
    "id": "5",
    "title": "Nina Carducci - Photographe",
    "cover": "/img/nina.png",
    "description": [
      "Optimisation des performances d'un site web grâce à des améliorations sur les images, la sémantique du code et les pratiques de développement.",
      "Mise en œuvre de principes avancés d'accessibilité web (WAVE) et d'optimisation SEO (Google Rich Snippet).",
      "Audit et ajustements basés sur les analyses de Google Lighthouse pour améliorer le score de performance.",
      "Utilisation d'outils professionnels pour garantir une expérience utilisateur et un SEO de haute qualité."
    ],
    "langage": "SEO/Développement",
    "competences": [
      "Intégrer du contenu conformément à une maquette avec HTML et CSS",
      "Implémenter une interface responsive avec HTML et CSS"
    ],
    "pictures": [
      "./img/nina-1.png",
      "./img/nina-2.png",
      "./img/nina-3.png",
      "./img/nina-4.png"
    ],
    "repo": "https://github.com/hp590490/NinaCarducci"
  },
  {
    "id": "6",
    "title": "Application web de location immobilière",
    "cover": "/img/kasa.png",
    "description": [
      "Développement d'une application web en React, avec gestion et affichage dynamique des données.",
      "Mise en œuvre de composants réutilisables et modulaires pour une maintenance simplifiée.",
      "Gestion de l'état et des données via hooks (useState, useEffect) et Props.",
      "Communication avec une API pour affichage des données en temps réel.",
      "Respect des meilleures pratiques React pour performance et maintenabilité.",
      "Implémentation d'un design responsive pour une expérience optimale sur tous les appareils."
    ],
    "langage": "React",
    "competences": [
      "Intégrer du contenu conformément à une maquette avec HTML et CSS",
      "Implémenter une interface responsive avec HTML et CSS"
    ],
    "pictures": [
      "./img/kasa-1.png",
      "./img/kasa-2.png",
      "./img/kasa-3.png",
      "./img/kasa-4.png"
    ],
    "repo": "https://github.com/hp590490/reactOC"
  },
  {
    "id": "7",
    "title": "Mon Vieux Grimoir : site de notation de livres",
    "cover": "/img/back.png",
    "description": [
      "Développement d'une API backend pour un site de notation de livres avec système d'authentification sécurisé (bcrypt, JWT).",
      "Implémentation de middlewares pour la gestion des autorisations et des requêtes.",
      "Utilisation de MongoDB avec des modèles et schémas pour la structuration et la gestion des données.",
      "Organisation du code avec gestion des routes, controllers, et logique métier.",
      "Création et gestion dynamique des fonctionnalités CRUD pour les livres et les utilisateurs."
    ],
    "langage": "React",
    "competences": [
      "Intégrer du contenu conformément à une maquette avec HTML et CSS",
      "Implémenter une interface responsive avec HTML et CSS"
    ],
    "pictures": [
      "./img/back-1.png",
      "./img/back-2.png",
      "./img/back-3.png",
      "./img/back-4.png"
    ],
    "repo": "https://github.com/hp590490/newprojetlivres"
  },
  {
    "id": "8",
    "title": "Menu Maker par Qwenta : plannification de son développement",
    "cover": "/img/plan.png",
    "description": [
      "Rédaction des spécifications techniques pour le projet de développement d'un site web.",
      "Application de la méthode agile/scrum pour la gestion du projet.",
      "Utilisation de Trello pour créer un kanban, attribuer les tâches et définir les priorités de chaque tâche. Un numéro de difficulté a été attribué pour chaque tâche, en prenant comme exemple la suite de Fibonacci.",
      "Veille technologique active à l’aide de Daily.dev, Feedly, Reddit, X, et Slack pour se tenir informé des dernières tendances et outils."
    ],
    "langage": "SEO/Développement",
    "competences": [
      "Intégrer du contenu conformément à une maquette avec HTML et CSS",
      "Implémenter une interface responsive avec HTML et CSS"
    ],
    "pictures": [
      "./img/plan-3.png",
      "./img/plan-4.png",
      "./img/plan-5.png",
      "./img/plan-6.png",
      "./img/plan-2.png"
    ],
    "repo": "https://github.com/hp590490/qwenta"
  },
  {
    "id": "9",
    "title": "Portfolio developpeur web junior - Hugo PLASTRE",
    "cover": "/img/portfolio.png",
    "description": [
      "Affichage dynamique de données (projets, informations personnelles, etc.) en utilisant React.",
      "Capacité de restitution claire et dynamique des projets réalisés, permettant de les présenter efficacement sur une page web originale et personnalisée.",
      "Intégration d'un système de modale pour une présentation interactive des informations ou projets.",
      "Mise en place d'un filtre pour organiser et naviguer facilement à travers les projets.",
      "Conception et intégration d'un formulaire de contact fonctionnel."
    ],
    "langage": "React",
    "competences": [
      "Intégrer du contenu conformément à une maquette avec HTML et CSS",
      "Implémenter une interface responsive avec HTML et CSS"
    ],
    "pictures": ["./img/portfolio-1.png", "./img/portfolio-2.png"],
    "repo": "https://github.com/hp590490/portfolio"
  }
]
